<?php

namespace App\Helpers;
class Geo
{
    public static function countries()
    {
        return
            [
                [
                    'id' => 'Австралия',
                    'name' => 'Австралия',
                ],
                [
                    'id' => 'Австрия',
                    'name' => 'Австрия',
                ],
                [
                    'id' => 'Азербайджан',
                    'name' => 'Азербайджан',
                ],
                [
                    'id' => 'Албания',
                    'name' => 'Албания',
                ],
                [
                    'id' => 'Алжир',
                    'name' => 'Алжир',
                ],
                [
                    'id' => 'Американское Самоа',
                    'name' => 'Американское Самоа',
                ],
                [
                    'id' => 'Ангилья',
                    'name' => 'Ангилья',
                ],
                [
                    'id' => 'Ангола',
                    'name' => 'Ангола',
                ],
                [
                    'id' => 'Андорра',
                    'name' => 'Андорра',
                ],
                [
                    'id' => 'Антигуа и Барбуда',
                    'name' => 'Антигуа и Барбуда',
                ],
                [
                    'id' => 'Макао, Аомынь',
                    'name' => 'Макао, Аомынь',
                ],
                [
                    'id' => 'Аргентина',
                    'name' => 'Аргентина',
                ],
                [
                    'id' => 'Армения',
                    'name' => 'Армения',
                ],
                [
                    'id' => 'Аруба',
                    'name' => 'Аруба',
                ],
                [
                    'id' => 'Афганистан',
                    'name' => 'Афганистан',
                ],
                [
                    'id' => 'Багамские Острова',
                    'name' => 'Багамские Острова',
                ],
                [
                    'id' => 'Бангладеш',
                    'name' => 'Бангладеш',
                ],
                [
                    'id' => 'Барбадос',
                    'name' => 'Барбадос',
                ],
                [
                    'id' => 'Бахрейн',
                    'name' => 'Бахрейн',
                ],
                [
                    'id' => 'Белиз',
                    'name' => 'Белиз',
                ],
                [
                    'id' => 'Белоруссия',
                    'name' => 'Белоруссия',
                ],
                [
                    'id' => 'Бельгия',
                    'name' => 'Бельгия',
                ],
                [
                    'id' => 'Бенин',
                    'name' => 'Бенин',
                ],
                [
                    'id' => 'Бермудские Острова',
                    'name' => 'Бермудские Острова',
                ],
                [
                    'id' => 'Болгария',
                    'name' => 'Болгария',
                ],
                [
                    'id' => 'Боливия',
                    'name' => 'Боливия',
                ],
                [
                    'id' => 'Бонайре, Синт-Эстатиус и Саба',
                    'name' => 'Бонайре, Синт-Эстатиус и Саба',
                ],
                [
                    'id' => 'Босния и Герцеговина',
                    'name' => 'Босния и Герцеговина',
                ],
                [
                    'id' => 'Ботсвана',
                    'name' => 'Ботсвана',
                ],
                [
                    'id' => 'Бразилия',
                    'name' => 'Бразилия',
                ],
                [
                    'id' => 'Британская территория в Индийском океане',
                    'name' => 'Британская территория в Индийском океане',
                ],
                [
                    'id' => 'Бруней',
                    'name' => 'Бруней',
                ],
                [
                    'id' => 'Буркина-Фасо',
                    'name' => 'Буркина-Фасо',
                ],
                [
                    'id' => 'Бурунди',
                    'name' => 'Бурунди',
                ],
                [
                    'id' => 'Бутан',
                    'name' => 'Бутан',
                ],
                [
                    'id' => 'Вануату',
                    'name' => 'Вануату',
                ],
                [
                    'id' => 'Ватикан',
                    'name' => 'Ватикан',
                ],
                [
                    'id' => 'Великобритания',
                    'name' => 'Великобритания',
                ],
                [
                    'id' => 'Венгрия',
                    'name' => 'Венгрия',
                ],
                [
                    'id' => 'Венесуэла',
                    'name' => 'Венесуэла',
                ],
                [
                    'id' => 'Виргинские Острова (США)',
                    'name' => 'Виргинские Острова (США)',
                ],
                [
                    'id' => 'Виргинские Острова (Великобритания)',
                    'name' => 'Виргинские Острова (Великобритания)',
                ],
                [
                    'id' => 'Восточный Тимор',
                    'name' => 'Восточный Тимор',
                ],
                [
                    'id' => 'Вьетнам',
                    'name' => 'Вьетнам',
                ],
                [
                    'id' => 'Габон',
                    'name' => 'Габон',
                ],
                [
                    'id' => 'Гаити',
                    'name' => 'Гаити',
                ],
                [
                    'id' => 'Гайана',
                    'name' => 'Гайана',
                ],
                [
                    'id' => 'Гамбия',
                    'name' => 'Гамбия',
                ],
                [
                    'id' => 'Гана',
                    'name' => 'Гана',
                ],
                [
                    'id' => 'Гваделупа',
                    'name' => 'Гваделупа',
                ],
                [
                    'id' => 'Гватемала',
                    'name' => 'Гватемала',
                ],
                [
                    'id' => 'Гвинея',
                    'name' => 'Гвинея',
                ],
                [
                    'id' => 'Гвинея-Бисау',
                    'name' => 'Гвинея-Бисау',
                ],
                [
                    'id' => 'Германия',
                    'name' => 'Германия',
                ],
                [
                    'id' => 'Гернси',
                    'name' => 'Гернси',
                ],
                [
                    'id' => 'Гибралтар',
                    'name' => 'Гибралтар',
                ],
                [
                    'id' => 'Гондурас',
                    'name' => 'Гондурас',
                ],
                [
                    'id' => 'Гонконг',
                    'name' => 'Гонконг',
                ],
                [
                    'id' => 'Гренада',
                    'name' => 'Гренада',
                ],
                [
                    'id' => 'Гренландия',
                    'name' => 'Гренландия',
                ],
                [
                    'id' => 'Греция',
                    'name' => 'Греция',
                ],
                [
                    'id' => 'Грузия',
                    'name' => 'Грузия',
                ],
                [
                    'id' => 'Гуам',
                    'name' => 'Гуам',
                ],
                [
                    'id' => 'Дания',
                    'name' => 'Дания',
                ],
                [
                    'id' => 'Джерси',
                    'name' => 'Джерси',
                ],
                [
                    'id' => 'Джибути',
                    'name' => 'Джибути',
                ],
                [
                    'id' => 'Доминика',
                    'name' => 'Доминика',
                ],
                [
                    'id' => 'Доминиканская Республика',
                    'name' => 'Доминиканская Республика',
                ],
                [
                    'id' => 'Египет',
                    'name' => 'Египет',
                ],
                [
                    'id' => 'Замбия',
                    'name' => 'Замбия',
                ],
                [
                    'id' => 'Зимбабве',
                    'name' => 'Зимбабве',
                ],
                [
                    'id' => 'Израиль',
                    'name' => 'Израиль',
                ],
                [
                    'id' => 'Индия',
                    'name' => 'Индия',
                ],
                [
                    'id' => 'Индонезия',
                    'name' => 'Индонезия',
                ],
                [
                    'id' => 'Иордания',
                    'name' => 'Иордания',
                ],
                [
                    'id' => 'Ирак',
                    'name' => 'Ирак',
                ],
                [
                    'id' => 'Иран',
                    'name' => 'Иран',
                ],
                [
                    'id' => 'Ирландия',
                    'name' => 'Ирландия',
                ],
                [
                    'id' => 'Исландия',
                    'name' => 'Исландия',
                ],
                [
                    'id' => 'Испания',
                    'name' => 'Испания',
                ],
                [
                    'id' => 'Италия',
                    'name' => 'Италия',
                ],
                [
                    'id' => 'Йемен',
                    'name' => 'Йемен',
                ],
                [
                    'id' => 'Кабо-Верде',
                    'name' => 'Кабо-Верде',
                ],
                [
                    'id' => 'Казахстан',
                    'name' => 'Казахстан',
                ],
                [
                    'id' => 'Камбоджа',
                    'name' => 'Камбоджа',
                ],
                [
                    'id' => 'Камерун',
                    'name' => 'Камерун',
                ],
                [
                    'id' => 'Канада',
                    'name' => 'Канада',
                ],
                [
                    'id' => 'Катар',
                    'name' => 'Катар',
                ],
                [
                    'id' => 'Кения',
                    'name' => 'Кения',
                ],
                [
                    'id' => 'Кипр',
                    'name' => 'Кипр',
                ],
                [
                    'id' => 'Киргизия',
                    'name' => 'Киргизия',
                ],
                [
                    'id' => 'Кирибати',
                    'name' => 'Кирибати',
                ],
                [
                    'id' => 'Китай',
                    'name' => 'Китай',
                ],
                [
                    'id' => 'Колумбия',
                    'name' => 'Колумбия',
                ],
                [
                    'id' => 'Коморы',
                    'name' => 'Коморы',
                ],
                [
                    'id' => 'Демократическая Республика Конго',
                    'name' => 'Демократическая Республика Конго',
                ],
                [
                    'id' => 'Республика Конго',
                    'name' => 'Республика Конго',
                ],
                [
                    'id' => 'КНДР',
                    'name' => 'КНДР',
                ],
                [
                    'id' => 'Республика Корея',
                    'name' => 'Республика Корея',
                ],
                [
                    'id' => 'Коста-Рика',
                    'name' => 'Коста-Рика',
                ],
                [
                    'id' => 'Кот-д’Ивуар',
                    'name' => 'Кот-д’Ивуар',
                ],
                [
                    'id' => 'Куба',
                    'name' => 'Куба',
                ],
                [
                    'id' => 'Кувейт',
                    'name' => 'Кувейт',
                ],
                [
                    'id' => 'Кюрасао',
                    'name' => 'Кюрасао',
                ],
                [
                    'id' => 'Лаос',
                    'name' => 'Лаос',
                ],
                [
                    'id' => 'Латвия',
                    'name' => 'Латвия',
                ],
                [
                    'id' => 'Лесото',
                    'name' => 'Лесото',
                ],
                [
                    'id' => 'Либерия',
                    'name' => 'Либерия',
                ],
                [
                    'id' => 'Ливан',
                    'name' => 'Ливан',
                ],
                [
                    'id' => 'Ливия',
                    'name' => 'Ливия',
                ],
                [
                    'id' => 'Литва',
                    'name' => 'Литва',
                ],
                [
                    'id' => 'Лихтенштейн',
                    'name' => 'Лихтенштейн',
                ],
                [
                    'id' => 'Люксембург',
                    'name' => 'Люксембург',
                ],
                [
                    'id' => 'Маврикий',
                    'name' => 'Маврикий',
                ],
                [
                    'id' => 'Мавритания',
                    'name' => 'Мавритания',
                ],
                [
                    'id' => 'Мадагаскар',
                    'name' => 'Мадагаскар',
                ],
                [
                    'id' => 'Майотта',
                    'name' => 'Майотта',
                ],
                [
                    'id' => 'Малави',
                    'name' => 'Малави',
                ],
                [
                    'id' => 'Малайзия',
                    'name' => 'Малайзия',
                ],
                [
                    'id' => 'Мали',
                    'name' => 'Мали',
                ],
                [
                    'id' => 'Мальдивы',
                    'name' => 'Мальдивы',
                ],
                [
                    'id' => 'Мальта',
                    'name' => 'Мальта',
                ],
                [
                    'id' => 'Марокко',
                    'name' => 'Марокко',
                ],
                [
                    'id' => 'Мартиника',
                    'name' => 'Мартиника',
                ],
                [
                    'id' => 'Маршалловы Острова',
                    'name' => 'Маршалловы Острова',
                ],
                [
                    'id' => 'Мексика',
                    'name' => 'Мексика',
                ],
                [
                    'id' => 'Мозамбик',
                    'name' => 'Мозамбик',
                ],
                [
                    'id' => 'Молдавия',
                    'name' => 'Молдавия',
                ],
                [
                    'id' => 'Монако',
                    'name' => 'Монако',
                ],
                [
                    'id' => 'Монголия',
                    'name' => 'Монголия',
                ],
                [
                    'id' => 'Монтсеррат',
                    'name' => 'Монтсеррат',
                ],
                [
                    'id' => 'Мьянма',
                    'name' => 'Мьянма',
                ],
                [
                    'id' => 'Намибия',
                    'name' => 'Намибия',
                ],
                [
                    'id' => 'Науру',
                    'name' => 'Науру',
                ],
                [
                    'id' => 'Непал',
                    'name' => 'Непал',
                ],
                [
                    'id' => 'Нигер',
                    'name' => 'Нигер',
                ],
                [
                    'id' => 'Нигерия',
                    'name' => 'Нигерия',
                ],
                [
                    'id' => 'Нидерланды',
                    'name' => 'Нидерланды',
                ],
                [
                    'id' => 'Никарагуа',
                    'name' => 'Никарагуа',
                ],
                [
                    'id' => 'Ниуэ',
                    'name' => 'Ниуэ',
                ],
                [
                    'id' => 'Новая Зеландия',
                    'name' => 'Новая Зеландия',
                ],
                [
                    'id' => 'Новая Каледония',
                    'name' => 'Новая Каледония',
                ],
                [
                    'id' => 'Норвегия',
                    'name' => 'Норвегия',
                ],
                [
                    'id' => 'ОАЭ',
                    'name' => 'ОАЭ',
                ],
                [
                    'id' => 'Оман',
                    'name' => 'Оман',
                ],
                [
                    'id' => 'Острова Кайман',
                    'name' => 'Острова Кайман',
                ],
                [
                    'id' => 'Острова Кука',
                    'name' => 'Острова Кука',
                ],
                [
                    'id' => 'Острова Питкэрн',
                    'name' => 'Острова Питкэрн',
                ],
                [
                    'id' => 'Острова Святой Елены, Вознесения и Тристан-да-Кунья',
                    'name' => 'Острова Святой Елены, Вознесения и Тристан-да-Кунья',
                ],
                [
                    'id' => 'Остров Норфолк',
                    'name' => 'Остров Норфолк',
                ],
                [
                    'id' => 'Остров Рождества',
                    'name' => 'Остров Рождества',
                ],
                [
                    'id' => 'Пакистан',
                    'name' => 'Пакистан',
                ],
                [
                    'id' => 'Палау',
                    'name' => 'Палау',
                ],
                [
                    'id' => 'Панама',
                    'name' => 'Панама',
                ],
                [
                    'id' => 'Папуа — Новая Гвинея',
                    'name' => 'Папуа — Новая Гвинея',
                ],
                [
                    'id' => 'Парагвай',
                    'name' => 'Парагвай',
                ],
                [
                    'id' => 'Перу',
                    'name' => 'Перу',
                ],
                [
                    'id' => 'Польша',
                    'name' => 'Польша',
                ],
                [
                    'id' => 'Португалия',
                    'name' => 'Португалия',
                ],
                [
                    'id' => 'Пуэрто-Рико',
                    'name' => 'Пуэрто-Рико',
                ],
                [
                    'id' => 'Реюньон',
                    'name' => 'Реюньон',
                ],
                [
                    'id' => 'Россия',
                    'name' => 'Россия',
                ],
                [
                    'id' => 'Руанда',
                    'name' => 'Руанда',
                ],
                [
                    'id' => 'Румыния',
                    'name' => 'Румыния',
                ],
                [
                    'id' => 'Сальвадор',
                    'name' => 'Сальвадор',
                ],
                [
                    'id' => 'Самоа',
                    'name' => 'Самоа',
                ],
                [
                    'id' => 'Сан-Марино',
                    'name' => 'Сан-Марино',
                ],
                [
                    'id' => 'Сан-Томе и Принсипи',
                    'name' => 'Сан-Томе и Принсипи',
                ],
                [
                    'id' => 'Саудовская Аравия',
                    'name' => 'Саудовская Аравия',
                ],
                [
                    'id' => 'Северная Македония',
                    'name' => 'Северная Македония',
                ],
                [
                    'id' => 'Северные Марианские Острова',
                    'name' => 'Северные Марианские Острова',
                ],
                [
                    'id' => 'Сейшельские Острова',
                    'name' => 'Сейшельские Острова',
                ],
                [
                    'id' => 'Сенегал',
                    'name' => 'Сенегал',
                ],
                [
                    'id' => 'Сен-Бартелеми',
                    'name' => 'Сен-Бартелеми',
                ],
                [
                    'id' => 'Сен-Мартен',
                    'name' => 'Сен-Мартен',
                ],
                [
                    'id' => 'Сен-Пьер и Микелон',
                    'name' => 'Сен-Пьер и Микелон',
                ],
                [
                    'id' => 'Сент-Винсент и Гренадины',
                    'name' => 'Сент-Винсент и Гренадины',
                ],
                [
                    'id' => 'Сент-Китс и Невис',
                    'name' => 'Сент-Китс и Невис',
                ],
                [
                    'id' => 'Сент-Люсия',
                    'name' => 'Сент-Люсия',
                ],
                [
                    'id' => 'Сербия',
                    'name' => 'Сербия',
                ],
                [
                    'id' => 'Сингапур',
                    'name' => 'Сингапур',
                ],
                [
                    'id' => 'Синт-Мартен',
                    'name' => 'Синт-Мартен',
                ],
                [
                    'id' => 'Сирия',
                    'name' => 'Сирия',
                ],
                [
                    'id' => 'Словакия',
                    'name' => 'Словакия',
                ],
                [
                    'id' => 'Словения',
                    'name' => 'Словения',
                ],
                [
                    'id' => 'Соединённые Штаты Америки',
                    'name' => 'Соединённые Штаты Америки',
                ],
                [
                    'id' => 'Соломоновы Острова',
                    'name' => 'Соломоновы Острова',
                ],
                [
                    'id' => 'Сомали',
                    'name' => 'Сомали',
                ],
                [
                    'id' => 'Судан',
                    'name' => 'Судан',
                ],
                [
                    'id' => 'Суринам',
                    'name' => 'Суринам',
                ],
                [
                    'id' => 'Сьерра-Леоне',
                    'name' => 'Сьерра-Леоне',
                ],
                [
                    'id' => 'Таджикистан',
                    'name' => 'Таджикистан',
                ],
                [
                    'id' => 'Таиланд',
                    'name' => 'Таиланд',
                ],
                [
                    'id' => 'Танзания',
                    'name' => 'Танзания',
                ],
                [
                    'id' => 'Теркс и Кайкос',
                    'name' => 'Теркс и Кайкос',
                ],
                [
                    'id' => 'Того',
                    'name' => 'Того',
                ],
                [
                    'id' => 'Токелау',
                    'name' => 'Токелау',
                ],
                [
                    'id' => 'Тонга',
                    'name' => 'Тонга',
                ],
                [
                    'id' => 'Тринидад и Тобаго',
                    'name' => 'Тринидад и Тобаго',
                ],
                [
                    'id' => 'Тувалу',
                    'name' => 'Тувалу',
                ],
                [
                    'id' => 'Тунис',
                    'name' => 'Тунис',
                ],
                [
                    'id' => 'Туркмения',
                    'name' => 'Туркмения',
                ],
                [
                    'id' => 'Турция',
                    'name' => 'Турция',
                ],
                [
                    'id' => 'Уганда',
                    'name' => 'Уганда',
                ],
                [
                    'id' => 'Узбекистан',
                    'name' => 'Узбекистан',
                ],
                [
                    'id' => 'Украина',
                    'name' => 'Украина',
                ],
                [
                    'id' => 'Уоллис и Футуна',
                    'name' => 'Уоллис и Футуна',
                ],
                [
                    'id' => 'Уругвай',
                    'name' => 'Уругвай',
                ],
                [
                    'id' => 'Микронезия',
                    'name' => 'Микронезия',
                ],
                [
                    'id' => 'Фиджи',
                    'name' => 'Фиджи',
                ],
                [
                    'id' => 'Филиппины',
                    'name' => 'Филиппины',
                ],
                [
                    'id' => 'Финляндия',
                    'name' => 'Финляндия',
                ],
                [
                    'id' => 'Фолклендские острова',
                    'name' => 'Фолклендские острова',
                ],
                [
                    'id' => 'Франция',
                    'name' => 'Франция',
                ],
                [
                    'id' => 'Гвиана',
                    'name' => 'Гвиана',
                ],
                [
                    'id' => 'Французская Полинезия',
                    'name' => 'Французская Полинезия',
                ],
                [
                    'id' => 'Французские Южные и Антарктические территории',
                    'name' => 'Французские Южные и Антарктические территории',
                ],
                [
                    'id' => 'Хорватия',
                    'name' => 'Хорватия',
                ],
                [
                    'id' => 'ЦАР',
                    'name' => 'ЦАР',
                ],
                [
                    'id' => 'Чад',
                    'name' => 'Чад',
                ],
                [
                    'id' => 'Черногория',
                    'name' => 'Черногория',
                ],
                [
                    'id' => 'Чехия',
                    'name' => 'Чехия',
                ],
                [
                    'id' => 'Чили',
                    'name' => 'Чили',
                ],
                [
                    'id' => 'Швейцария',
                    'name' => 'Швейцария',
                ],
                [
                    'id' => 'Швеция',
                    'name' => 'Швеция',
                ],
                [
                    'id' => 'Шпицберген',
                    'name' => 'Шпицберген',
                ],
                [
                    'id' => 'Шри-Ланка',
                    'name' => 'Шри-Ланка',
                ],
                [
                    'id' => 'Эквадор',
                    'name' => 'Эквадор',
                ],
                [
                    'id' => 'Экваториальная Гвинея',
                    'name' => 'Экваториальная Гвинея',
                ],
                [
                    'id' => 'Эритрея',
                    'name' => 'Эритрея',
                ],
                [
                    'id' => 'Эсватини',
                    'name' => 'Эсватини',
                ],
                [
                    'id' => 'Эстония',
                    'name' => 'Эстония',
                ],
                [
                    'id' => 'Эфиопия',
                    'name' => 'Эфиопия',
                ],
                [
                    'id' => 'ЮАР',
                    'name' => 'ЮАР',
                ],
                [
                    'id' => 'Южный Судан',
                    'name' => 'Южный Судан',
                ],
                [
                    'id' => 'Ямайка',
                    'name' => 'Ямайка',
                ],
                [
                    'id' => 'Япония',
                    'name' => 'Япония',
                ]

            ];
    }

    public static function regions()
    {
        return [
            [
                'id' => 'Донецкая Народная Республика (ДНР)',
                'name' => 'Донецкая Народная Республика (ДНР)',
            ],
            [
                'id' => 'Луганская Народная Республика (ЛНР)',
                'name' => 'Луганская Народная Республика (ЛНР)',
            ],
            [
                'id' => 'Запорожская область',
                'name' => 'Запорожская область',
            ],
            [
                'id' => 'Херсонская область',
                'name' => 'Херсонская область',
            ],
            [
                'id' => 'Республика Адыгея',
                'name' => 'Республика Адыгея',
            ],
            [
                'id' => 'Республика Алтай',
                'name' => 'Республика Алтай',
            ],
            [
                'id' => 'Республика Башкортостан',
                'name' => 'Республика Башкортостан',
            ],
            [
                'id' => 'Республика Бурятия',
                'name' => 'Республика Бурятия',
            ],
            [
                'id' => 'Республика Дагестан',
                'name' => 'Республика Дагестан',
            ],
            [
                'id' => 'Республика Ингушетия',
                'name' => 'Республика Ингушетия',
            ],
            [
                'id' => 'Кабардино-Балкарская Республика',
                'name' => 'Кабардино-Балкарская Республика',
            ],
            [
                'id' => 'Республика Калмыкия',
                'name' => 'Республика Калмыкия',
            ],
            [
                'id' => 'Карачаево-Черкесская Республика',
                'name' => 'Карачаево-Черкесская Республика',
            ],
            [
                'id' => 'Республика Карелия',
                'name' => 'Республика Карелия',
            ],
            [
                'id' => 'Республика Коми',
                'name' => 'Республика Коми',
            ],
            [
                'id' => 'Республика Крым',
                'name' => 'Республика Крым',
            ],
            [
                'id' => 'Республика Марий Эл',
                'name' => 'Республика Марий Эл',
            ],
            [
                'id' => 'Республика Мордовия',
                'name' => 'Республика Мордовия',
            ],
            [
                'id' => 'Республика Саха (Якутия)',
                'name' => 'Республика Саха (Якутия)',
            ],
            [
                'id' => 'Республика Северная Осетия — Алания',
                'name' => 'Республика Северная Осетия — Алания',
            ],
            [
                'id' => 'Республика Татарстан',
                'name' => 'Республика Татарстан',
            ],
            [
                'id' => 'Республика Тыва',
                'name' => 'Республика Тыва',
            ],
            [
                'id' => 'Удмуртская Республика',
                'name' => 'Удмуртская Республика',
            ],
            [
                'id' => 'Республика Хакасия',
                'name' => 'Республика Хакасия',
            ],
            [
                'id' => 'Чеченская Республика',
                'name' => 'Чеченская Республика',
            ],
            [
                'id' => 'Чувашская Республика — Чувашия',
                'name' => 'Чувашская Республика — Чувашия',
            ],
            [
                'id' => 'Алтайский край',
                'name' => 'Алтайский край',
            ],
            [
                'id' => 'Забайкальский край',
                'name' => 'Забайкальский край',
            ],
            [
                'id' => 'Камчатский край',
                'name' => 'Камчатский край',
            ],
            [
                'id' => 'Краснодарский край',
                'name' => 'Краснодарский край',
            ],
            [
                'id' => 'Красноярский край',
                'name' => 'Красноярский край',
            ],
            [
                'id' => 'Пермский край',
                'name' => 'Пермский край',
            ],
            [
                'id' => 'Приморский край',
                'name' => 'Приморский край',
            ],
            [
                'id' => 'Ставропольский край',
                'name' => 'Ставропольский край',
            ],
            [
                'id' => 'Хабаровский край',
                'name' => 'Хабаровский край',
            ],
            [
                'id' => 'Амурская область',
                'name' => 'Амурская область',
            ],
            [
                'id' => 'Архангельская область',
                'name' => 'Архангельская область',
            ],
            [
                'id' => 'Астраханская область',
                'name' => 'Астраханская область',
            ],
            [
                'id' => 'Белгородская область',
                'name' => 'Белгородская область',
            ],
            [
                'id' => 'Брянская область',
                'name' => 'Брянская область',
            ],
            [
                'id' => 'Владимирская область',
                'name' => 'Владимирская область',
            ],
            [
                'id' => 'Волгоградская область',
                'name' => 'Волгоградская область',
            ],
            [
                'id' => 'Вологодская область',
                'name' => 'Вологодская область',
            ],
            [
                'id' => 'Воронежская область',
                'name' => 'Воронежская область',
            ],
            [
                'id' => 'Ивановская область',
                'name' => 'Ивановская область',
            ],
            [
                'id' => 'Иркутская область',
                'name' => 'Иркутская область',
            ],
            [
                'id' => 'Калининградская область',
                'name' => 'Калининградская область',
            ],
            [
                'id' => 'Калужская область',
                'name' => 'Калужская область',
            ],
            [
                'id' => 'Кемеровская область — Кузбасс',
                'name' => 'Кемеровская область — Кузбасс',
            ],
            [
                'id' => 'Кировская область',
                'name' => 'Кировская область',
            ],
            [
                'id' => 'Костромская область',
                'name' => 'Костромская область',
            ],
            [
                'id' => 'Курганская область',
                'name' => 'Курганская область',
            ],
            [
                'id' => 'Курская область',
                'name' => 'Курская область',
            ],
            [
                'id' => 'Ленинградская область',
                'name' => 'Ленинградская область',
            ],
            [
                'id' => 'Липецкая область',
                'name' => 'Липецкая область',
            ],
            [
                'id' => 'Магаданская область',
                'name' => 'Магаданская область',
            ],
            [
                'id' => 'Московская область',
                'name' => 'Московская область',
            ],
            [
                'id' => 'Мурманская область',
                'name' => 'Мурманская область',
            ],
            [
                'id' => 'Нижегородская область',
                'name' => 'Нижегородская область',
            ],
            [
                'id' => 'Новгородская область',
                'name' => 'Новгородская область',
            ],
            [
                'id' => 'Новосибирская область',
                'name' => 'Новосибирская область',
            ],
            [
                'id' => 'Омская область',
                'name' => 'Омская область',
            ],
            [
                'id' => 'Оренбургская область',
                'name' => 'Оренбургская область',
            ],
            [
                'id' => 'Орловская область',
                'name' => 'Орловская область',
            ],
            [
                'id' => 'Пензенская область',
                'name' => 'Пензенская область',
            ],
            [
                'id' => 'Псковская область',
                'name' => 'Псковская область',
            ],
            [
                'id' => 'Ростовская область',
                'name' => 'Ростовская область',
            ],
            [
                'id' => 'Рязанская область',
                'name' => 'Рязанская область',
            ],
            [
                'id' => 'Самарская область',
                'name' => 'Самарская область',
            ],
            [
                'id' => 'Саратовская область',
                'name' => 'Саратовская область',
            ],
            [
                'id' => 'Сахалинская область',
                'name' => 'Сахалинская область',
            ],
            [
                'id' => 'Свердловская область',
                'name' => 'Свердловская область',
            ],
            [
                'id' => 'Смоленская область',
                'name' => 'Смоленская область',
            ],
            [
                'id' => 'Тамбовская область',
                'name' => 'Тамбовская область',
            ],
            [
                'id' => 'Тверская область',
                'name' => 'Тверская область',
            ],
            [
                'id' => 'Томская область',
                'name' => 'Томская область',
            ],
            [
                'id' => 'Тульская область',
                'name' => 'Тульская область',
            ],
            [
                'id' => 'Тюменская область',
                'name' => 'Тюменская область',
            ],
            [
                'id' => 'Ульяновская область',
                'name' => 'Ульяновская область',
            ],
            [
                'id' => 'Челябинская область',
                'name' => 'Челябинская область',
            ],
            [
                'id' => 'Ярославская область',
                'name' => 'Ярославская область',
            ],
            [
                'id' => 'Москва',
                'name' => 'Москва',
            ],
            [
                'id' => 'Санкт-Петербург',
                'name' => 'Санкт-Петербург',
            ],
            [
                'id' => 'Севастополь',
                'name' => 'Севастополь',
            ],
            [
                'id' => 'Еврейская АО',
                'name' => 'Еврейская АО',
            ],
            [
                'id' => 'Ненецкий АО',
                'name' => 'Ненецкий АО',
            ],
            [
                'id' => 'Ханты-Мансийский АО — Югра',
                'name' => 'Ханты-Мансийский АО — Югра',
            ],
            [
                'id' => 'Чукотский АО',
                'name' => 'Чукотский АО',
            ],
            [
                'id' => 'Ямало-Ненецкий АО',
                'name' => 'Ямало-Ненецкий АО',
            ]
        ];
    }

}
