<main>
    <section class="content uppercase text-center flex flex-col items-center mb-16">
        <h1 class="text-green-500">Корпоративный университет «Экосистема»</h1>
        <h1>Просветительская программа</h1>
        <h1 class="text-green-500">«мастерская экознаний»</h1>
    </section>

    <section class="w-full bg-green-500 mb-16">
        <video autoplay="" muted="" width="100%" loop="loop">
            <source src="/fixed/fn.mp4" type="video/mp4">
        </video>
    </section>

    <section class="content text-center text-xl mb-16 flex flex-col items-center">
        <x-link class="w-full px-8 py-4 max-w-md mt-4 mb-20">Подать заявку</x-link>
        <h1 class="text-green-500">ПЛАН ПРОСВЕТИТЕЛЬСКОЙ ПРОГРАММЫ</h1>
        <h1 class="">«МАСТЕРСКАЯ ЭКОЗНАНИЙ»</h1>
    </section>

    <section id="lessons" class="bg-green-500 rounded-tr-[240px] rounded-bl-[240px] md:rounded-none py-24 mb-24">
        <div class="flex flex-col gap-4 content [&>*:nth-child(even)]:ml-auto">
            @foreach($lessons as $lesson)
                <div x-data="{ open: false }" class="flex bg-white py-10 pr-10 rounded w-1/2 md:w-full relative">
                    <div class="px-8 flex items-center justify-center">
                        <svg class="w-20"
                             viewBox="0 0 129.9 131.1" style="enable-background:new 0 0 129.9 131.1;"
                             xml:space="preserve">
<path style="fill:none;stroke:#7BB929;stroke-width:3.0019;stroke-miterlimit:10;" d="M17.5,1.6h94.6c8.8,0,16,7.2,16,16v95.8
	c0,8.8-7.2,16-16,16H17.5c-8.8,0-16-7.2-16-16V17.6C1.6,8.8,8.7,1.6,17.5,1.6L17.5,1.6z"/>
                            <path
                                style="fill-rule:evenodd;clip-rule:evenodd;fill:#7BB929;stroke:#7BB929;stroke-width:0.9363;stroke-miterlimit:10;"
                                d="
	M85.5,64.8l5.8,3.1c1.7,1,7.5,5,7.5,6.8c0,0.7-0.3,1.6-1.2,1.6c-1.8,0-2.6-1-4.1-2.2c-2-1.6-4.1-3-6.4-4.2l-3.4-1.7
	c-6.2-3-12.4-4.1-20-4.1c-1.4,0-5.6,8.3-5.6,11c0,5.5,7,4.8,11.5,9.3c1.2,1.2,2,3,2,5.2c0,2.8-5.4,12.7,0.5,12.8
	c4.8,0,9.7-8.6,16.8-3.8c3.4,2.3,4.1,2.2,8,0.9c4.1-1.4,7.8-1.8,12.4-1.8c-1.1-4.8-4-10.4-7-14.3c-1.2-1.6-1.6-3.9,0.9-3.9
	c1.5,0,4.1,4.7,4.7,5.8c4.1,6.8,6.7,15.4,6.7,24.2c0,1-0.2,2.6-1.4,2.6c-2.8,0-2.3-2.2-2.3-4.9c-0.1-1.9-0.7-4-0.7-5.8
	c-3.2,0-6.8,0.4-9.5,1c-1.3,0.3-2.6,0.7-3.8,1.1c-7.6,2.9-8.4-2.4-12.7-2.4c-3.4,0-7.2,5.1-11.7,5.1c-7.2,0-7.7-7.1-5.9-12.2
	c0.5-1.2,1.2-2.6,1.2-4.2c0-5.3-8.8-5.3-11.8-9.3c-2.7-3.6-1.7-7.4-0.2-11.1c0.5-1.1,0.7-1.5,1.3-2.5c0.4-0.8,1.1-1.5,1.3-2.4
	c-6.1,0.5-12.9,3.5-18,6.6c-5,3-9.4,7.1-12.8,11.8C24.5,87,24,89,21.8,93.2c3.5,0,6.7,0.7,9,3.2c1.9,2.1,2.9,5,6.3,5.6
	c4,0.7,5.6,0.7,8.8,3.3c1.2,0.9,1.9,2,2.7,3.4c0.8,1.3,1,3.2-1.1,3.2c-2.1,0-1.9-2.6-5.3-4.8c-2.6-1.7-4.9-1-7.7-2.1
	c-4.3-1.7-4.6-5.1-7.7-7c-1-0.6-2.4-1.1-3.8-1.1c-3.2,0-2.6,0.1-3.3,3.5c-0.6,3-0.9,5.5-0.9,8.7c0,1.7-0.7,2.6-1.4,2.8h-0.9
	c-0.8-0.2-1.4-0.9-1.4-1.9c0-14.7,6.9-27.2,14.3-34.6C45.8,58.9,65.4,56.6,85.5,64.8z"/>
                            <path
                                style="fill-rule:evenodd;clip-rule:evenodd;fill:#7BB929;stroke:#7BB929;stroke-width:1.2481;stroke-miterlimit:10;"
                                d="
	M68.6,51.1l3-4.2c0.2-0.3,0.4-0.5,0.7-0.8c0.5-0.6,0.9-1.1,1.4-1.6l2.1-2.3c0.3-0.3,0.5-0.5,0.7-0.7l5.8-5.1l3.9-2.7
	c1.5-0.9,3.9-2.3,5.6-3c0.4-0.2,1.6-0.5,1.7-1.3c0-0.8-0.6-1.2-1-1.3c-0.8,0-5.4,2.5-6.7,3.2c-0.3,0.2-0.6,0.4-0.9,0.6
	c-0.6,0.4-1.2,0.7-1.7,1.1l-1.7,1.2c-0.2,0.1-0.2,0.1-0.4,0.3c-2,1.6-3.2,2.7-5.1,4.3l-3.6,3.8c-1.5,1.7-2.6,3-4,4.8
	c-0.2,0.3-0.4,0.6-0.6,0.9c-0.2,0.3-0.5,0.6-0.6,0.9c-1.3-1-2.6-5.6-2.5-7.9c0.2-3,0.6-5.3,2-7.8c0.5-0.9,1.3-2.2,2-2.9
	c1.7-1.8,2.5-2.6,4.8-4.1c2.1-1.3,4.4-2.4,6.7-3.2c5.8-2,13.7-3,19.8-3c0.4,0,1.3,0,1.8,0l5.8,0.1c-0.2,0.2-0.4,0.4-0.6,0.6
	c-0.2,0.2-0.4,0.4-0.6,0.6l-1.2,1.3c-0.4,0.5-0.7,0.9-1.1,1.3c-6.7,8.1-6.6,15.6-10.1,22.3c-0.8,1.6-2.2,3.9-3.5,5.1
	c-1.2,1-0.5,0.6-2,1.6c-0.5,0.4-1,0.6-1.5,0.9c-1,0.5-2.4,1-3.6,1.1c-3.9,0.6-8.7-0.3-12.1-2.3c-1.1-0.6-1.6-0.9-2.5-1.8
	C68.7,51.1,68.9,51.2,68.6,51.1L68.6,51.1z M108.4,18.4l1.9,0.1c0.6,0.1,1.1,0.4,1.1,1.1c0,0.6-0.3,0.8-0.9,1.4
	c-0.4,0.4-0.8,0.6-1.1,1c-0.2,0.2-0.3,0.3-0.5,0.6c-1.1,1-3.1,3.5-4,4.6c-0.2,0.2-0.3,0.4-0.4,0.6c-1.1,1.6-1.5,2.3-2.4,4.1
	c-1.7,3.3-2.4,6.2-3.5,9.7c-1.3,4-3.4,9-6.5,11.9c-0.2,0.2-0.3,0.3-0.5,0.5c-2.1,1.7-4.3,2.9-7,3.4c-2.5,0.5-3.4,0.3-5.8,0.2
	c-3.5-0.2-7.5-1.7-10.3-3.8c-0.4-0.3-0.7-0.6-1.1-0.9c-1.4,2.2-2.9,5.1-3.7,7.7c-0.2,0.8-0.2,2.5-1.3,2.5c-0.8,0-1.1-0.5-1.1-1.2
	l0.1-0.9c0.2-0.9,0.6-1.9,0.8-2.5c0.4-1,1.2-3,1.8-3.9l2-3.5c-0.3-0.4-0.7-0.9-1.4-2c-1.2-2-1.7-4.2-1.9-6.5c0-0.6-0.1-1,0-1.5
	l0.1-1.6c0.1-1.3,0.5-2.7,0.8-3.8c0.9-2.8,2.1-4.8,4-6.9c0.6-0.7,0.7-0.7,1.1-1.1l3.5-2.8c2.7-1.9,7.8-3.9,11.1-4.7
	c4.4-1.1,8.7-1.7,13.4-1.9l7-0.1c0.4,0,0.4-0.1,0.9,0C105.7,18.3,106.9,18.3,108.4,18.4z"/>
                            <path
                                style="fill-rule:evenodd;clip-rule:evenodd;fill:#7BB929;stroke:#7BB929;stroke-width:1.2481;stroke-miterlimit:10;"
                                d="
	M56.4,55.5l-2-2.8c-0.2-0.2-0.3-0.3-0.4-0.5c-0.3-0.4-0.6-0.7-0.9-1.1l-1.4-1.5c-0.2-0.2-0.3-0.3-0.5-0.5l-3.8-3.3l-2.5-1.7
	c-1-0.6-2.6-1.5-3.7-2C40.8,42,40,41.8,40,41.3c0-0.5,0.4-0.8,0.7-0.8c0.5,0,3.6,1.6,4.4,2.1c0.2,0.1,0.4,0.3,0.6,0.4
	c0.4,0.2,0.8,0.5,1.1,0.7l1.1,0.8c0.1,0.1,0.1,0.1,0.3,0.2c1.3,1,2.1,1.8,3.4,2.9l2.4,2.5c1,1.1,1.7,2,2.6,3.2
	c0.1,0.2,0.3,0.4,0.4,0.6c0.1,0.2,0.3,0.4,0.4,0.6c0.9-0.7,1.7-3.7,1.6-5.2c-0.1-2-0.4-3.5-1.3-5.1c-0.4-0.6-0.9-1.4-1.3-1.9
	c-1.1-1.2-1.6-1.7-3.1-2.7c-1.4-0.9-2.9-1.6-4.4-2.1c-3.8-1.3-9-2-13-2c-0.3,0-0.9,0-1.2,0l-3.8,0.1c0.1,0.2,0.3,0.2,0.4,0.4
	c0.1,0.2,0.3,0.2,0.4,0.4l0.8,0.8c0.3,0.3,0.5,0.6,0.7,0.9c4.4,5.3,4.3,10.2,6.6,14.7c0.5,1,1.4,2.6,2.3,3.3
	c0.8,0.7,0.3,0.4,1.3,1.1c0.3,0.2,0.6,0.4,1,0.6c0.6,0.3,1.6,0.6,2.4,0.7c2.6,0.4,5.7-0.2,7.9-1.5c0.7-0.4,1-0.6,1.7-1.2
	C56.3,55.5,56.2,55.6,56.4,55.5L56.4,55.5z M30.2,34l-1.3,0.1c-0.4,0.1-0.7,0.3-0.7,0.7c0,0.4,0.2,0.5,0.6,0.9
	c0.2,0.2,0.5,0.4,0.7,0.7c0.2,0.1,0.2,0.2,0.4,0.4c0.7,0.6,2.1,2.3,2.6,3c0.1,0.1,0.2,0.3,0.3,0.4c0.7,1.1,1,1.5,1.6,2.7
	c1.1,2.1,1.6,4.1,2.3,6.4c0.8,2.6,2.2,5.9,4.3,7.8c0.2,0.1,0.2,0.2,0.3,0.3c1.4,1.1,2.8,1.9,4.6,2.3c1.6,0.3,2.2,0.2,3.8,0.1
	c2.3-0.1,4.9-1.1,6.7-2.5c0.3-0.2,0.5-0.4,0.7-0.6c0.9,1.5,1.9,3.4,2.4,5.1c0.1,0.5,0.1,1.7,0.9,1.6c0.5,0,0.7-0.4,0.7-0.8l0-0.6
	c-0.1-0.6-0.4-1.3-0.5-1.6c-0.3-0.6-0.8-2-1.2-2.5l-1.3-2.3c0.2-0.3,0.5-0.6,0.9-1.3c0.8-1.3,1.1-2.8,1.2-4.3c0-0.4,0-0.7,0-1
	L60.3,48c-0.1-0.8-0.3-1.8-0.5-2.5c-0.6-1.8-1.4-3.1-2.6-4.6c-0.4-0.4-0.5-0.5-0.7-0.7l-2.3-1.9c-1.8-1.3-5.2-2.6-7.3-3.1
	c-2.9-0.7-5.7-1.1-8.8-1.3l-4.6-0.1c-0.3,0-0.3,0-0.6,0C31.9,33.9,31.2,33.9,30.2,34L30.2,34z"/>
</svg>
                    </div>
                    <div class="flex flex-col">
                        <p class="uppercase">{{$lesson->module['name']}}. {{$lesson['name']}}</p>
                        <p class="font-bold mb-6">{{$lesson->module['title']}}</p>
                        <p>{{$lesson['title']}}</p>
                        <p x-show="open" class="mt-2">{{$lesson['desc']}}</p>
                    </div>
                    <!-- Треугольник -->
                    <div
                        @click="open = !open"
                        :class="open ? 'rotate-0 md:rotate-0' : '-rotate-90 md:rotate-180'"
                        class="absolute bottom-2 -right-8  w-0 h-0 border-l-8 border-l-transparent border-r-8 border-r-transparent border-b-8 border-b-white transition-transform duration-300 cursor-pointer md:border-b-green-500 md:right-1/2 "
                    ></div>
                </div>
            @endforeach
        </div>
    </section>

    <section id="speakers" class="content relative mx-auto mb-24">
        <h1 class="mx-auto mb-16"><span class="text-green-500">СПИКЕРЫ</span> КУРСА</h1>
        <x-ui.speakers-slider/>
    </section>

    <section id="faq"  class="mb-32">
        <h1 class="mx-auto mb-16"><span class="text-green-500">ПОПУЛЯРНЫЕ</span> ВОПРОСЫ</h1>
        <div class="bg-gray-300 py-24 mb-24 ">
            <div class="content flex flex-col gap-10 relative">
                <svg class=" absolute w-24 h-auto -rotate-90 left-0 -top-[162px]" id="Слой_1"
                     xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                     viewBox="0 0 227 317.6" style="enable-background:new 0 0 227 317.6;" xml:space="preserve">
<g>
    <defs>
        <rect id="SVGID_1_" x="0" y="0.2" width="227" height="157.5"/>
    </defs>
    <clipPath id="SVGID_00000147928381815892485800000004314386547326068097_">
        <use xlink:href="#SVGID_1_" style="overflow:visible;"/>
    </clipPath>

    <path
        style="clip-path:url(#SVGID_00000147928381815892485800000004314386547326068097_);fill-rule:evenodd;clip-rule:evenodd;fill:#78BE0A;"
        d="
		M226,159.3L113,0.2L0,159.3H226z M192.4,159.3L113,47.5L33.6,159.3H192.4z"/>
</g>
                    <g>
                        <defs>
                            <rect id="SVGID_00000120522871054874737380000017847625778002714535_" x="0" y="158.8"
                                  width="227" height="157.5"/>
                        </defs>
                        <clipPath id="SVGID_00000150070066417644749780000011864268922607637407_">
                            <use xlink:href="#SVGID_00000120522871054874737380000017847625778002714535_"
                                 style="overflow:visible;"/>
                        </clipPath>

                        <path
                            style="clip-path:url(#SVGID_00000150070066417644749780000011864268922607637407_);fill-rule:evenodd;clip-rule:evenodd;fill:#78BE0A;"
                            d="
		M226,317.9L113,158.8L0,317.9H226z M192.4,317.9L113,206.1L33.6,317.9H192.4z"/>
                    </g>
</svg>

                <div>
                    <p class="font-bold mb-2">Что нужно для того, чтобы начать обучение?</p>
                    <p>Для того, чтобы начать обучение, необходимо зарегистрироваться, нажав на копку «ПОДАТЬ ЗАЯВКУ» на
                        главной странице сайта. Для активации личного кабинета вам нужно подтвердить номер телефона.</p>
                </div>
                <div>
                    <p class="font-bold mb-2">Это платная программа?</p>
                    <p>Программа бесплатная.</p>
                </div>
                <div>
                    <p class="font-bold mb-2">Мне 16 лет, могу ли я получить доступ и пройти просветительскую программу
                        «Мастерская экознаний»?</p>
                    <p>Принять участие в просветительской программе «Мастерская экознаний» можно от 18 лет.</p>
                </div>
                <div>
                    <p class="font-bold mb-2">Из чего состоит программа?</p>
                    <p>Программа состоит из четырёх модулей, в которых содержатся 10 видеолекций. В первом модуле вы
                        познакомитесь с основами экологии и экологического мышления. Весь второй модуль связан с
                        экологическими коммуникациями и тем, как человек и экология влияют друг на друга. Третий модуль
                        посвящён экологическим вызовам и решениям. В четвёртом — узнаете о законодательных аспектах
                        экологического движения в Российской Федерации.</p>
                </div>
                <div>
                    <p class="font-bold mb-2">Что будет, если я не смогу посмотреть лекцию именно в день выхода? Она
                        будет доступна позже?</p>
                    <p>Если вы подключитесь позже, вам будет доступно прохождение всех материалов программы.</p>
                </div>
                <div>
                    <p class="font-bold mb-2">Тесты нужны для самопроверки или же полученные за их выполнение баллы идут
                        в общий зачёт?</p>
                    <p>За тесты даются баллы, которые вносят вклад в итоговую оценку. На прохождение теста даётся 1
                        попытка.</p>
                </div>
                <div>
                    <p class="font-bold mb-2">Предполагается ли какой-то экзамен в конце программы? Получу ли я какое-то
                        свидетельство о ее окончании?</p>
                    <p>Да, в конце четвёртого модуля предполагается выполнение итоговых заданий по всем изученным
                        материалам. Всем участникам, прошедшим просветительскую программу, будет направлен электронный
                        сертификат.</p>
                </div>
                <div>
                    <p class="font-bold mb-2">Куда обращаться, если возникли вопросы?</p>
                    <p>Пишите на почту программы cu_ecosistema@mail.ru или звоните по телефону +79932875359. Мы
                        обязательно вам ответим.</p>
                </div>
                <svg class=" absolute w-24 h-auto rotate-90 right-0 -bottom-[162px]" id="Слой_1"
                     xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                     viewBox="0 0 227 317.6" style="enable-background:new 0 0 227 317.6;" xml:space="preserve">
<g>
    <defs>
        <rect id="SVGID_1_" x="0" y="0.2" width="227" height="157.5"/>
    </defs>
    <clipPath id="SVGID_00000147928381815892485800000004314386547326068097_">
        <use xlink:href="#SVGID_1_" style="overflow:visible;"/>
    </clipPath>

    <path
        style="clip-path:url(#SVGID_00000147928381815892485800000004314386547326068097_);fill-rule:evenodd;clip-rule:evenodd;fill:#78BE0A;"
        d="
		M226,159.3L113,0.2L0,159.3H226z M192.4,159.3L113,47.5L33.6,159.3H192.4z"/>
</g>
                    <g>
                        <defs>
                            <rect id="SVGID_00000120522871054874737380000017847625778002714535_" x="0" y="158.8"
                                  width="227" height="157.5"/>
                        </defs>
                        <clipPath id="SVGID_00000150070066417644749780000011864268922607637407_">
                            <use xlink:href="#SVGID_00000120522871054874737380000017847625778002714535_"
                                 style="overflow:visible;"/>
                        </clipPath>

                        <path
                            style="clip-path:url(#SVGID_00000150070066417644749780000011864268922607637407_);fill-rule:evenodd;clip-rule:evenodd;fill:#78BE0A;"
                            d="
		M226,317.9L113,158.8L0,317.9H226z M192.4,317.9L113,206.1L33.6,317.9H192.4z"/>
                    </g>
</svg>

            </div>
    </section>

    <section id="login" class="content mb-32 text-center">
        @auth()
            <x-link class="mx-auto px-8" href="{{route('account.courses')}}" wire:navigate>Личный кабинет</x-link>
        @else
            <h1 class="mx-auto mb-16">Авторизация</h1>
            <livewire:pages.auth.login/>
        @endauth
    </section>
</main>
